k = 0

for s in open('kege/9/9_2_1.py'):
    n = sorted([int(x) for x in s.split()])
    # уравнение треугольника 
    if n[0] + n[1] > n[2]: #+
        a = a
    # проверка может ли быть три стороны тупоугольным треугольником 
    if n[0]**2 + n[1]**2 < n[2]**2: #-
        a != a
    # проверка может ли быть три стороны остроугольным треугольником 
    if n[0]**2 + n[1]**2 > n[2]**2: #-
        a=a
    # проверка могут ли быть три стороны прямоуголным треугольником 
    if n[0]**2 + n[1]**2 == n[2]**2: #-
        a=a 
